# BuiltInFailures.PartMakerMethodForMergePartFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
BuiltInFailures Class Members See Also
---
Failures related to part merge operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PartMakerMethodForMergePartFailures
```

Visual Basic
---
```text
Public NotInheritable Class PartMakerMethodForMergePartFailures
```

Visual C++
---
```text
public ref class PartMakerMethodForMergePartFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PartMakerMethodForMergePartFailures
# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Members
Autodesk.Revit.DB Namespace